---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarCouplerError.BarsNotTouching
enum: Autodesk.Revit.DB.Structure.RebarCouplerError
source: html/36b8947f-6ee1-8f70-f2fc-ab52dd1afd90.htm
---
# Autodesk.Revit.DB.Structure.RebarCouplerError.BarsNotTouching

The selected ends of the bars are too far apart.